public class Work75 {
  public static void main(String[] args) {
    // 引数なしのコンストラクタを使用して
    // Point75型のインスタンスp1を生成
    // ↓↓↓ここにコードを追加↓↓↓
    Point75 p1 = new Point75();
    // ↑↑↑ここにコードを追加↑↑↑

    // 2つのint型の引数を持つコンストラクタを使用して
    // x座標が7で、y座標が8の
    // Point75型のインスタンスp2を生成
    // ↓↓↓ここにコードを追加↓↓↓
    Point75 p2 = new Point75(7, 8);
    // ↑↑↑ここにコードを追加↑↑↑

    // 2つのdouble型の引数を持つコンストラクタを使用して
    // x座標が8.9で、y座標が10.2の
    // Point75型のインスタンスp3を生成
    // ↓↓↓ここにコードを追加↓↓↓
    Point75 p3 = new Point75(8.9, 10.2);
    // ↑↑↑ここにコードを追加↑↑↑

    // p1の情報をPoint75型のprintInfoメソッドを利用して
    // 実行例どおりに出力
    // ↓↓↓ここにコードを追加↓↓↓
    p1.printInfo("p1");
    // ↑↑↑ここにコードを追加↑↑↑

    // p2の情報をPoint75型のprintInfoメソッドを利用して
    // 実行例どおりに出力
    // ↓↓↓ここにコードを追加↓↓↓
    p2.printInfo("p2");
    // ↑↑↑ここにコードを追加↑↑↑

    // p3の情報をPoint75型のprintInfoメソッドを利用して
    // 実行例どおりに出力
    // ↓↓↓ここにコードを追加↓↓↓
    p3.printInfo("p3");
    // ↑↑↑ここにコードを追加↑↑↑

  }
}
